/*
1. var定义的变量可以修改，如果不初始化会输出undefined，不会报错
2. let是块级作用域，函数内部使用let定义后，对函数外部无影响
3. const定义的变量不可以修改，而且必须初始化

是否存在变量提升？
    var 声明的变量存在变量提升，全局作用域下是 window 属性
    let 和 const 声明的变量没有变量提升
能否重复声明？
    var 能重复声明
    let 和 const 不能重复声明
变量值能否修改？
    var 和 let 声明的值可以修改
    const 声明的值是常量，不能修改。如果声明的是引用类型，可以修改其属性
是否必须设置初始值？
    var 和 let 声明时可以不用设置初始值
    const 声明时必须设置初始值，不能使用 null 占位
否存在块级作用域（声明的变量只在该块级作用域内有效）？
    var 没有块级作用域
    let 和 const 有块级作用域
是否存在暂时性死区？
    暂时性死区：只要块级作用域有 let 或者 const 命令，他们所声明的变量就绑定这个区域，不受外部影响
    var 不存在暂时性死区
    let 和 const 存在暂时性死区
 */